# Andy Asher's Project 4 - Part 2

## Task 1. Create DataFrame

In [1]:
import pandas as pd
grades_dict = {'Wally': [85, 98, 70], 'Eva': [100, 77, 80], 'Sam': [84, 87, 90], 'Katie': [100, 71, 92], 'Bob': [73, 55, 95]}

In [2]:
grades = pd.DataFrame(grades_dict)

## Task 2. Custom Index

In [3]:
grades.index = ['Test1', 'Test2', 'Test3']

In [4]:
grades

       Wally  Eva  Sam  Katie  Bob
Test1     85  100   84    100   73
Test2     98   77   87     71   55
Test3     70   80   90     92   95

In [5]:
grades['Eva']

Test1    100
Test2     77
Test3     80
Name: Eva, dtype: int64

In [6]:
grades.Sam

Test1    84
Test2    87
Test3    90
Name: Sam, dtype: int64

## Task 3. Accessing Rows (loc, iloc)

In [7]:
grades.loc['Test1'] #I prefer this method because it seems easier to avoid forgetting to account for starting at 0

Wally     85
Eva      100
Sam       84
Katie    100
Bob       73
Name: Test1, dtype: int64

In [8]:
grades.iloc[1]

Wally    98
Eva      77
Sam      87
Katie    71
Bob      55
Name: Test2, dtype: int64

In [9]:
grades.loc['Test1':'Test3']

       Wally  Eva  Sam  Katie  Bob
Test1     85  100   84    100   73
Test2     98   77   87     71   55
Test3     70   80   90     92   95

In [10]:
grades.iloc[0:2]

       Wally  Eva  Sam  Katie  Bob
Test1     85  100   84    100   73
Test2     98   77   87     71   55

## Task 3. Accessing Subsets (at, iat)

In [11]:
grades.at['Test2', 'Eva']

77

In [12]:
grades.iat[2,0]

70

## Task 4. Describe (By Column)

In [13]:
grades.describe()

           Wally         Eva   Sam       Katie        Bob
count   3.000000    3.000000   3.0    3.000000   3.000000
mean   84.333333   85.666667  87.0   87.666667  74.333333
std    14.011900   12.503333   3.0   14.977761  20.033306
min    70.000000   77.000000  84.0   71.000000  55.000000
25%    77.500000   78.500000  85.5   81.500000  64.000000
50%    85.000000   80.000000  87.0   92.000000  73.000000
75%    91.500000   90.000000  88.5   96.000000  84.000000
max    98.000000  100.000000  90.0  100.000000  95.000000

In [15]:
pd.set_option('display.precision',2) #adding display. before precision is the new way to use this with pandas

In [ ]:
#I found all the possible arguments in the pandas documentation

## Task 5. Transpose (rows <--> columns)

In [ ]:
grades.mean()

In [16]:
grades.T

       Test1  Test2  Test3
Wally     85     98     70
Eva      100     77     80
Sam       84     87     90
Katie    100     71     92
Bob       73     55     95

In [17]:
grades.T.describe()

        Test1  Test2  Test3
count    5.00   5.00   5.00
mean    88.40  77.60  85.40
std     11.59  16.27  10.29
min     73.00  55.00  70.00
25%     84.00  71.00  80.00
50%     85.00  77.00  90.00
75%    100.00  87.00  92.00
max    100.00  98.00  95.00

## Task 6. Sort

In [18]:
grades.sort_index(ascending=False)

       Wally  Eva  Sam  Katie  Bob
Test3     70   80   90     92   95
Test2     98   77   87     71   55
Test1     85  100   84    100   73

In [19]:
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  Wally
Test1   73  100    100   84     85
Test2   55   77     71   87     98
Test3   95   80     92   90     70